[
  {
    "serial_number": "1",
    "date_of_judgment": "30-04-2025",
    "cause_title": "GAYATRI BALASAMY vs M/S ISG NOVASOFT TECHNOLOGIES LIMITEDC.A. No. 6178-6179/2025",
    "subject": "Power of the Court to modify an Arbitral Award under Section 34 and 37 of the Arbitration and Conciliation Act, 1996.",
    "summary": "GAYATRI BALASAMY V. M/S ISG NOVASOFT TECHNOLOGIES LIMITED2025 INSC 605(30 April 2025)Justices:Chief Justice Sanjiv Khanna, Justice Bhushan R. Gavai, Justice Sanjay Kumar, Justice Kalpathy V. Viswanathan, Justice Augustine G. Masih.Question(s):(i)Whether the Indian Courts are jurisdictionally empowered to modify an arbitral award.(ii)Whether the power to set aside an award under Section 34 of the Arbitration and Conciliation Act 1996 being a larger power, will include the power to modify an arbitral award and if so, to what extent.(iii)Whether an arbitral award can be modified by using Article 142 of the Constitution.Factual Background:Gayatri Balasamy (“Appellant”), an employee at ISG Novasoft Technologies Ltd., filed a criminal complaint against senior officers of the company for offences relating to sexual harassment which was met with criminal complaints of defamation and extortion by the company. When the matter reached the Supreme Court, it was referred to arbitration, where the Arbitral Tribunal awarded the Appellant  ?2 crores. Dissatisfied, she sought to set aside the award under Section 34 of the Arbitration and Conciliation Act 1996 (“1996 Act”) before the Madras High Court. The High Court modified the award, granting an additional ?1.6 crores. However, a Division Bench on appeal under Section 37 of the 1996 Act reduced this additional award to ?50,000, deeming the initial compensation excessive. The Appellant then appealed to the Supreme Court.On February 20, 2024, a Three-Judge Bench of the Supreme Court identified an essential question of law regarding the power of courts to modify an arbitral award under Section 34 and 37 of the 1996 Act. The Court noted conflicting opinions in two lines of cases. Decisions likeMcDermot International Inc. v. Burn Standard Co. Ltd. and Others(2006 INSC 325) andProject Director, NHAI v. M Hakeem(2021 INSC 344) limited judicial intervention under Section 34 to express grounds, disallowing error correction, cost reconsideration, or merit review. Conversely, cases such asVedanta Limited v. Shenzhen Shandong Nuclear Power Construction Company Ltd.(2018 INSC 959) andOil and Natural Gas Corporation Ltd v. Western GECO International Ltd(2014 INSC 596) suggested setting aside arbitral awards or modification depending on the severability of the offending part. Consequently, the matter was referred to the Chief Justice of India, and a Constitution Bench (five judges) was constituted.Decision of the Supreme Court:The Supreme Court, by a 4:1 majority, held that courts possess a limited power under Section 34 and 37 of the 1996 Act to modify an arbitral award. The majority also affirmed the courts' power to modify post-award interest where justified. Chief Justice Khanna authored the majority judgment, while Justice Viswanathan wrote a dissenting opinion, holding that courts cannot modify an arbitral award.Reasons for the Decision:Severability of Arbitral Awards under Section 34 of the Arbitration and Conciliation Act 1996The majority held that the proviso to Section 34(2)(a)(iv) embodies the doctrine of severability, empowering courts to separate invalid portions of an arbitral award based on Section 34(2)(a) grounds while upholding valid parts (¶33 CJ. Khanna). This power of severability within the confines of Section 34 was deemed inherent in the Court’s jurisdiction (¶32 CJ. Khanna). Applying the doctrine ofomne majus continent in se minus(a greater power includes the lesser power) to the proviso of Section 32(2)(a)(iv), the majority held that the power to set aside an award necessarily includes the power to partially set it aside (¶34 CJ. Khanna). The majority held that this partial setting aside, was only permissible when valid and invalid portions were clearly segregable (¶36 CJ. Khanna).Justice Viswanathan, in his dissenting opinion, largely agreed that Section 34 inherently recognizes the power to sever parts of an arbitral award. However, he found that there was a conceptual difference between a “modification” and “severance” (¶8). He reasoned that Section 34(2)(a)(iv) and its proviso explicitly permit setting aside only the part of an award dealing with disputes not contemplated by or beyond the scope of arbitration, provided such decisions are severable (¶¶143-45). He found  this concept of severability extends to setting aside standalone claims that violate Section 34, provided they are separable and not intertwined (¶146, ¶149). He further held that the power to set aside includes partial setting aside and severing offending portions, provided the annulled part is independent and its removal does not impact other findings (¶152, ¶153). He held  that if a compromise affects only a severable portion, a Section 34 court can give effect to it by severing that part (¶154, ¶155). However, if the compromised aspects are inseparably intertwined, the court must either set aside the award or dismiss the Section 34 application (¶155).Justice Viswanathan, however, held that the power to modify an arbitral award is not a lesser power subsumed within the power to set aside. He reasoned that the legal maximomne majus continet in se minusdoes not apply to Section 34 of the 1996 Act because the qualitative nature of appellate power under the  Code of Civil Procedure, 1908 fundamentally differs from Section 34 power, operating in distinct spheres (¶¶84-88, ¶91). He reasoned  that modifying an award, which involves a court adjudicating on merits after parties agreed to arbitration, cannot be subsumed within the power to set aside (¶93). He found it untenable for the Court to read in the power to modify, given Parliament's repeated omissions of such a provision (¶95).A limited power of modification is located within the meaning of Section 34 of the Arbitration and Conciliation Act 1996The majority found that the 1996 Act aimed to expedite dispute resolution through a quicker, cost-effective alternative to litigation (¶40 CJ. Khanna). It held that denying courts the power to modify would lead to absurd outcomes,  impose hardships, increase costs, and cause delays, as Section 34 and 37 appeals often take years (¶41 CJ. Khanna). The majority reasoned that if courts could only set aside awards, parties would endure an extra round of arbitration to affirm a decision easily reached by the court (¶42 CJ. Khanna). Thus, the majority held that the power of judicial review under Section 34 and the setting aside of an arbitral award inherently include a limited power to modify the arbitral award (¶46 CJ. Khanna).Justice Viswanathan  held that courts lack the power to modify arbitral awards under Section 34 of the 1996 Act. He reasoned  that the 1996 Act’s focus on minimal judicial intervention, the absence of an express modification power (unlike the 1940 Act), and the plain language of Section 34—which only permits setting aside—establish this limitation (¶¶59,70,76). He rejected \"reading in\" the power to modify, deeming it unwarranted judicial overreach that contradicts clear legislative intent (¶90).Justice Viswanathan further  held that setting aside an award does not lead to an absurd outcome, as the 1996 Act allows for recommencement of proceedings, including arbitration, upon setting aside an award under Section 43(4). He reasoned that parties entering arbitration consciously agree to step out of the normal judicial process, and a Section 34 court, unless expressly authorized, cannot modify or vary an award (¶77, ¶81).Power of modification is different from remandThe majority found that under Section 34(4) of the 1996 Act, courts are empowered to remit issues back to the arbitral tribunal for specific determinations (¶56 CJ. Khanna). Upon remand, the tribunal can vary, correct, review, add, or modify the award. However, the majority held that Section 34(4) does not authorize the tribunal to rewrite or set aside the award on merits; rather, it acts as a curative mechanism available when permitted by the court (¶60 CJ. Khanna). The majority  held that computational, clerical, and typographical errors not requiring a merits evaluation can be modified by the Court in a Section 34 application (¶53 CJ. Khanna).The Supreme Court discarded the view inKinnari Mullick v. Ghanshyam Das Damani(2017 INSC 1281), which required only a written application for remand under Section 34(4), holding that under Section 37 of the 1996 Act, the Court still possesses jurisdiction to remand the mattersuo motu(¶62 CJ. Khanna, ¶¶131-132 J. Vishwanathan).Justice Viswanathan found that Section 33 allows the Arbitral Tribunal to correct computational, clerical, or similar errors and make additional awards for unadjudicated claims (¶¶128-129). He held that the power to adjourn the proceedings and remit the matter to the Arbitral Tribunal under Section 34(4) can be exercised for undoing the curable defects(¶134). He found that this power is to cure defects like inadequate reasoning or filling gaps in existing findings, but not for supplying findings on contentious issues absent from the original award (¶134, ¶¶141-142). He held that a limited exception  based on theactus curiae neminem gravabitprinciple allows the court under Section 34 to correct obvious computational, clerical, or typographical errors without modifying the original award's terms even if the arbitrator has not exercised its power under Section 33 (¶137, ¶¶140-141).Modification does not render the amended award unenforceable under the New York ConventionThe majority held that interpreting Section 34 to include a limited power to modify awards will not affect the enforcement of foreign awards under international commercial arbitration (¶66 CJ. Khanna). The majority reasoned that Article V of the New York Convention and Section 46 of the 1996 Act, similarly worded, recognize the supremacy of the domestic law of the country where the award is made for enforcement purposes (¶67 CJ. Khanna). However, Justice Viswanathan held that modifying New York Convention awards in India would complicate foreign enforcement due to the lack of statutory provisions (unlike UK/Singapore) that treat a modified award as part of the Tribunal's award (¶121, ¶123). He pointed out that this issue warrants legislative intervention (¶ J. Viswanathan ¶123).Court can modify post award interest but not pendente liteThe majority held that the Court cannot modifypendente liteinterest granted during arbitration (¶72 CJ. Khanna). Where the interest awarded contradicts the contractual position, the court, when examining objections under Section 34, can either set aside the interest rate or remand the matter to the arbitral tribunal under Section 34(4) (¶73 CJ. Khanna). The majority observed that post-award interest under Section 37(1)(b) is an additional compensation for unpaid arbitral awards after due time (¶74 CJ. Khanna). In cases where this post-award interest appears unjustified, given the unpredictability of the future unknown to the arbitrator, it is necessary for the Court to have the authority to modify it for the dissipation of justice (¶76 CJ. Khanna).Justice Vishwanthan in his dissenting opinion held that a court cannot modify interest, including post-award interest, and the proper course is to remit the matter to the arbitrator for correction under Section 34(4) (¶135, ¶156). He also held that the Court maysuo motuexercise this Section 34(4) power if it finds grounds to set aside the award, as its purpose is to allow the tribunal to cure defects and make the award enforceable (¶136).Supreme Court’s power to do complete justice under Article 142 of the ConstitutionThe majority  held that the Supreme Court's power under Article 142 of the Constitution must be exercised in consonance with the fundamental principles and objectives of the 1996 Act (¶82 CJ. Khanna). The majority reasoned that this power can be used in arbitration proceedings to end protracted litigation and save parties' time and money.  However, it should not be used to rewrite or modify the award on merits (¶84 CJ. Khanna).Justice Viswanathan, in his dissenting opinion, held that the Supreme Court's powers under Article 142 of the Constitution cannot be exercised to modify an arbitral award when matters arise from Section 34 of the 1996 Act. He reasoned that established jurisprudence on Article 142 clearly states it cannot be used to \"supplant\" substantive law, achieve indirectly what cannot be achieved directly, or contradict express statutory provisions. He held that modifying an arbitral award under Article 142 strikes at the core ethos of the arbitration process, breaching a pre-eminent prohibition within the 1996 Act. He found that such intervention would create grave uncertainties for contracting parties and be antithetical to arbitration as an effective dispute resolution mode (¶¶ 108-115).Prepared by Raza Zaidi and Osama NoorCentre for Research and Planning | Supreme Court of IndiaCase Materials:Day 1 of Arguments: 13 February 2025(Argument Transcript) |(Video Recording)Day 2 of Arguments: 18 February 2025(Argument Transcript) |(Video Recording)Day 3 of Arguments: 19 February 2025(Argument Transcripts) |(Video Recording)Read MoreView Judgment"
  },
  {
    "serial_number": "2",
    "date_of_judgment": "15-04-2025",
    "cause_title": "VARSHATAI vs THE STATE OF MAHARASHTRAC.A. No. 5187-5188/2025",
    "subject": "Validity of using Urdu as an additional language for official purposes in Maharashtra.",
    "summary": "VARSHATAI V. THE STATE OF MAHARASHTRA2025 INSC 486(15 April 2025)Justices:Justice Sudhanshu Dhulia and Justice Krishnan V. ChandranQuestion(s):(i) Whether the High Court of Bombay was correct in concluding that the Maharashtra Local Authorities (Official Languages) Act, 2022 does not prohibit the use of Urdu as an additional language on the signboard of a Municipal Council building in Maharashtra.Factual Background:A signboard of the new building of the Municipal Council, Patur in district Akola, Maharashtra displayed the text “Municipal Council, Patur”, in Marathi at the top followed by its Urdu translation. The appellant objected to the use of Urdu, contending that since Marathi was the official language of the State of Maharashtra, the work of the Municipal Council could only be conducted in Marathi and therefore the use of Urdu in any manner was impermissible. The Municipal Council rejected these objections. Subsequently, the appellant moved an application under Section 308 of the Maharashtra Township Act, 1965 before the Collector Akola, praying for setting aside of the Municipal Council’s resolution which was allowed. The Municipal Council challenged the Collector’s actions before the Divisional Commissioner, Amravati and the Collector’s order was set aside. Aggrieved, the appellant filed a Writ Petition before the Bombay High Court seeking prohibition on the use of Urdu in all the work conducted by government and government bodies in Maharashtra. However, the High Court did not consider it a case calling for interference. Aggrieved, the appellant challenged the High Court’s order before the Supreme Court.During the pendency of the appeal, the Maharashtra Local Authorities (Official Languages) Act, 2022 (“2022 Act”) had been enacted. The appellant contended that under Section 3 of the 2022 Act, the use of Urdu on the signboard of the Municipal Council could not be permitted. The Supreme Court, observed that the 2022 Act had come into force during the pendency of appeal and therefore the appellant should again approach the High Court under the changed legislative position. The High Court heard the matter again and decided that even under the new legislation i.e 2022 Act, the use of an additional language to display the name of Municipal Council on its building would not indicate any violation. Thus, the appellant approached the Supreme Court in the present proceedings.Decision of the Supreme Court:The Division Bench (two judges) of the Supreme Court upheld the decision of the High Court holding that there was no prohibition on the use of Urdu under the 2022 Act. The judgment of the Court was authored by Justice Dhulia.Reasons for the Decision:Language essentially is a tool for effective communicationThe Division Bench (two judges) observed that Section 3(2) of the 2022 Act provides for the use of English in situations where communication cannot be properly conveyed in Marathi or in situations where the persons to whom such communications are addressed cannot understand Marathi. This indicates that the 2022 Act recognizes that language is essentially a tool for effective communication (¶15).The Supreme Court further held that the primary aim of the establishment of a Municipal Council is to cater to the immediate needs of the local community of its respective area. If the members of the local community in Patur are familiar with Urdu then there should not be any objection if Urdu is used in addition to the official language on the signboard of the Municipal Council’s building since language is a medium for the exchange of ideas that bring people holding diverse views and beliefs closer and it should not become a cause of their division (¶46).Language is representative of a cultureThe Division Bench (two judges) observed that with more than 122 major languages including the 22 scheduled languages mentioned in the Constitution, hundreds of mother tongues and thousands of dialects used throughout the country, India is the most multilingual country in the world. However, this linguistic diversity makes the discussion on language both sensitive and delicate since each of these languages is representative of a respective culture, community or region (¶21). The Supreme Court further observed that Urdu is a representative of the composite cultural ethos organga-jamuni tehzeebof the plains of northern and central India which has developed over the course of centuries (¶18). During the independence movement, when a need was felt for the greater use of the Indian languages, ‘Hindustani’ which is an amalgamation of various Indian languages especially Urdu and Hindi, was given popular support for the purpose of national integration (¶28).The Division Bench (two judges) further underscored the importance of adhering to the constitutional value of ‘tolerance’ while dealing with the linguistic diversity in India (¶21). Moreover, Article 351 of the Constitution emphasizes on the spread of Hindi language by assimilating the forms and expressions used in Hindustani and other languages of the Eighth Schedule of the Constitution imbibes the idea of constitutional tolerance while dealing with the issue of linguistic diversity in India (¶22).Considering practical necessity, States can permit the use of more than one languages for official purposesThe Division Bench (two judges) observed that Article 345 of the Constitution empowers the State legislature to adopt Hindi or any other language in use in that State as the official language of the State (¶23). However, a Constitution Bench (five judges) of the Supreme Court inUttar Pradesh Hindi Sahitya Sammelan v. State of Uttar Pradesh (2014 INSC 594)while dealing with the issue of adoption of Urdu as the second official language by the State of Uttar Pradesh had held that mere adoption of a particular language as the official language of the State does not bar the State legislature from again invoking powers under Article 345 to designate yet another language as the official language(s) if required (¶25).The Supreme Court further observed that various State and Union Territories in India have more than one official language, or permit the use of more than one language for official purposes based upon the practical necessity to ensure effective communication with the people therein (¶26).Urdu not alien to India rather it was born and flourished IndiaThe Division Bench (two judges) observed that Urdu is an Indo-Aryan language just like Marathi and Hindi etc. It developed and flourished in India due to the need of the people belonging to different cultures who wanted to exchange ideas and communicate among themselves leading its development as a composite language.(¶27). The Supreme Court underscored that even today the common people in India use Urdu words in their everyday life to an extent that it will not be possible to have a day to day conversation without them (¶37). In fact, the States such as Andhra Pradesh, Bihar, Jharkhand, Telangana, Uttar Pradesh, and West Bengal, while the Union Territories of  Delhi and Jammu and Kashmir have adopted Urdu as one of their official languages (¶39).The Supreme Court noted that the Indian Courts have a heavy influence of Urdu in court jargons/parlance both in civil and criminal law. From adalat, halafnama, vakalatnama to peshi and dasti, this influence is writ large in the language of the Indian Courts (¶38). Therefore the Supreme Court emphasized that it was important to celebrate the linguistic diversity of India by making friends with Urdu and every other language (¶48).Prepared by Raza ZaidiCentre for Research and Planning |  Supreme Court of India© Supreme Court of IndiaRead MoreView Judgment"
  },
  {
    "serial_number": "3",
    "date_of_judgment": "28-03-2025",
    "cause_title": "IMRAN PRATAPGADHI vs STATE OF GUJARATCrl.A. No. 1545/2025",
    "subject": "Posting a poem promoting sacrifice and non-violence does not attract offences under Sections 196, 197, 299, 302, or 57 BNS; FIR registration in such cases is abuse of law.",
    "summary": "IMRAN PRATAPGADHI V. STATE OF GUJARAT2025 INSC 410(Invalid Date)Justices:Justice Abhay S. Oka, Justice Ujjal BhuyanQuestion(s):Whether the recitation and posting of a poem by the appellant constituted offences punishable under Sections 196, 197, 299, 302, and 57 of the Bharatiya Nyaya Sanhita, 2023 (BNS), and whether registration of the FIR violated the appellant’s fundamental rights under Article 19(1)(a) of the Constitution.Factual Background:The appellant, a Member of the Rajya Sabha, had posted on his verified ‘X’ (formerly Twitter) account a video clip from a mass marriage ceremony at which a poem was recited. The poem, in Urdu, metaphorically spoke of facing injustice with love and sacrificing personal losses for truth. A complaint alleged that the poem incited enmity between communities, promoted hatred, and harmed national unity. FIR was registered under Sections 196, 197(1), 302, 299, 57, and 3(5) of the BNS. The High Court dismissed the appellant’s petition seeking quashing of the FIR. The appellant approached the Supreme CourtDecision of the Supreme Court:The Supreme Court allowed the appeal, quashed the FIR, and held that registration of the FIR in respect of the posted poem was a mechanical exercise without application of mind, amounted to a clear abuse of process of law, and violated the fundamental right of the appellant under Article 19(1)(a) of the Constitution.Reasons for the Decision:Meaning of the Poem and Lack of OffenceThe Court, after carefully analysing the Urdu text and its English translation (¶9), concluded that the poem “has nothing to do with any religion, community, region or race” (¶10(a)). It neither affects national integration nor jeopardizes sovereignty, unity, or integrity of India (¶10(b), (c)). The Court emphasized that the poem “preaches non-violence” and encourages meeting injustice with love and sacrifice, not by resorting to violence (¶10(f), ¶10(h)). It noted that the reference to the \"throne\" was symbolic and denoted resistance against injustice rather than incitement against any community (¶10(g)).No Ingredients of Offences Made OutThe Court exhaustively examined the ingredients of Section 196 of the BNS (¶13-14) and observed that the poem did not promote disharmony, hatred, or ill-will between religious, racial, linguistic or regional groups. The poem neither disturbed public tranquility nor sought to create disharmony (¶14). The offence under Section 197 was also ruled out as there was no assertion or imputation against any religious, racial, language, regional group, caste, or community (¶16). The Court found the invocation of Section 299 “ridiculous” (¶17), as the poem did not outrage religious feelings or insult religious beliefs. Similarly, the allegation under Section 302, requiring deliberate intention to wound religious feelings, was found wholly baseless (¶18). Section 57 concerning abetment by the public was found to have no nexus, as there was no act of abetment proved or alleged (¶19).Duty to Respect Freedom of Speech and Role of Preliminary Inquiry under BNSSThe Court emphasized the mandatory requirement of registration of FIR under Section 173(1) of BNSS only if a cognizable offence is disclosed (¶20-22).However, the Court clarified that sub-section (3) of Section 173 allows a preliminary inquiry even where the offence is cognizable if the offence is punishable for three years or more but less than seven years (¶23-24). In the present case, since the offences alleged fell within that range (except Section 57), the police ought to have conducted a preliminary inquiry (¶28-29).The Court stressed that where allegations concern spoken or written words potentially attracting the exception under Article 19(2) of the Constitution, the police must exercise particular care and undertake preliminary inquiry (¶30). The obligation of the police to respect constitutional ideals under Article 51-A(a) was highlighted (¶29).Standard to Judge Alleged Offensive SpeechQuoting the paragraph 67 of the judgment authored by Bose and Puranik, JJ in Bhagwati Charan Shukla v. Provincial Government, C.P. & Berar (1946 SCC OnLine MP 5), the Court held that the effect of words must be judged “using the standards of reasonable, strong-minded, firm and courageous men, and not those of weak and vacillating minds” (¶32-33).The Court reaffirmed that the poem, viewed from this standard, did not incite hatred or enmity and in fact promoted resilience against injustice through peaceful means.Requirement of Mens ReaThe Court reiterated that mens rea is an essential ingredient for offences under Section 196, following its earlier decisions in Manzar Sayeed Khan v. State of Maharashtra (2007) 5 SCC 1 and Patricia Mukhim v. State of Meghalaya (2021) 15 SCC 35 (¶34).It held that there was no deliberate intention on part of the appellant to promote enmity or ill-will, and thus, even on prima facie basis, the necessary mens rea was absent.The Court severely criticized the High Court for failing to appreciate the fundamental constitutional protection of freedom of speech (¶35-37). It noted that the High Court wrongly relied on the \"nascent stage of investigation\" to refuse quashing the FIR despite no prima facie case being made out. It reaffirmed that Courts can and must quash proceedings at the initial stage itself to prevent abuse of process (¶37).Importance of Protecting Freedom of ExpressionThe Court eloquently reaffirmed that free expression is \"an integral part of a healthy, civilised society\" and is indispensable to a dignified life under Article 21 (¶38). Courts must be vigilant to protect constitutional rights even if the content of speech is unpopular or uncomfortable to some (¶39-40). Reliance was placed on Anand Chintamani Dighe v. State of Maharashtra (2001 SCC OnLine Bom 891) and Shreya Singhal v. Union of India (2015) 5 SCC 1 to reiterate that tolerance for dissent and non-mainstream views is a cardinalconstitutional value (¶40-41).The Court summarized in ¶42-44 that Section 173(3) of BNSS permits preliminary inquiry even where a cognizable offence is disclosed if the punishment is between three to seven years. The police must act sensitively in such matters, particularly where free speech under Article 19(1)(a) is concerned. The Court emphasized that registration of FIRs based on speech must not stifle fundamental freedoms unless reasonable restrictions under Article 19(2) are genuinely attracted.Prepared by Iram JanCommunications Division|  Supreme Court of India© Supreme Court of IndiaRead MoreView Judgment"
  },
  {
    "serial_number": "4",
    "date_of_judgment": "25-02-2025",
    "cause_title": "SUNIL KUMAR SINGH vs BIHAR LEGISLATIVE COUNCILW.P.(C) No. 530/2024",
    "subject": "Challenge to the expulsion of a member of the legislature",
    "summary": "SUNIL KUMAR SINGH V. BIHAR LEGISLATIVE COUNCIL2025 INSC 264(25 February 2025)Justices:Justice Surya Kant, Justice Nongmeukapam K. SinghQuestion(s):(i) Whether the Writ Petition filed by Mr. Sunil Kumar (“Petitioner”) challenging his expulsion from the Bihar Legislative Council (“BLC”)  is maintainable in view of Article 212 (1) of the Constitution of India and whether the proceedings of the Ethics Committee are amenable to judicial review. (ii) Can the Supreme Court in exercise of its writ jurisdiction review the proportionality of the punishment imposed by the House? (iii) If so, whether the Petitioner’s expulsion is disproportionate to the misconduct attributed to him and whether it merits any interference? (iv) Whether the Supreme  Court is empowered to determine the quantum of punishment that may be imposed on the Petitioner?Factual Background:The Petitioner, a member of the Rashtriya Janata Dal (“RJD”), filed a Writ Petition under Article 32 of the Constitution of India to challenge his expulsion from the Bihar Legislative Council (“BLC”). The Petitioner was alleged of unparliamentary conduct during the Governor’s address on 13 February  2024. Specifically, he and another Member of the Legislative Council (“MLC”), Md. Sohaib, disrupted the proceedings by using derogatory slogans and mimicking the Chief Minister. A formal complaint was lodged against them on 19 February  2024, leading the BLC Chairman to refer the matter to the Ethics Committee for inquiry. The Ethics Committee scheduled an inquiry for 3 May  2024, which Md. Sohaib attended, expressing regret. However, the Petitioner repeatedly sought exemptions, claiming  engagements related to the Lok Sabha elections and other commitments.He finally appeared before the Ethics Committee on 12 June 2024, but challenged the committee's authority rather than addressing the charges. The Ethics Committee then pre-poned their meeting from 19 June 2024 to 14 June 2024, without notifying the Petitioner, and concluded the proceedings. The Ethics Committee submitted its report on 14 June  2024, recommending the Petitioner's expulsion and Md. Sohaib's suspension for the first two days of the 208th Session of the House.On 26 July  2024, the BLC adopted the report, leading to the Petitioner’s expulsion and Md. Sohaib’s suspension. Subsequently, on 26 July 2024, the BLC Secretariat issued a notification formally relieving the Petitioner of his membership. During the petition's pendency, the Election Commission of India declared a bye-election for the vacant seat on 30 December  2024, with the process to conclude by 25 January 2025. The Supreme Court then stayed the declaration of the bye-election result on 15 January  2025.Decision of the Supreme Court:The Division Bench (two judges) of the Supreme Court quashed the punishment of  expulsion of the Petitioner from the BLC for being disproportionate and excessive.The Court held that the  prohibition under Article 212(1) only bars Constitutional Courts from reviewing the legislative proceedings for procedural irregularity. However, it does not prevent the judicial review of the legality or constitutionality of the legislature's actions (both lawmaking and administrative decisions). The judgement of the Court was authored by Justice Kant.Reasons for the Decision:The Division Bench (two judges) of the Supreme Court quashed the punishment of  expulsion of the Petitioner from the BLC for being disproportionate and excessive.The Court held that the  prohibition under Article 212(1) only bars Constitutional Courts from reviewing the legislative proceedings for procedural irregularity. However, it does not prevent the judicial review of the legality or constitutionality of the legislature's actions (both lawmaking and administrative decisions). The judgement of the Court was authored by Justice Kant.Reasons for the Decision:Maintainability of Writ Petition under Article 212(1) and Judicial Review of Ethics Committee ProceedingsThe Supreme Court rejected the objection to the maintainability of the writ petition under Article 212(1) of the Constitution, which bars judicial scrutiny ofprocedural irregularitiesin “Proceedings in the Legislature”. The Court reasoned that Article 212(1) protects only the formal steps and debates within the House (motions, deliberations etc.) from judicial inquiry but does not shield legislative decisions or administrative actions (¶¶10-14, ¶23). The Ethics Committee’s recommendation for the Petitioner’s expulsion was deemed an administrative function under Rules framed under Article 208, aimed at enforcing discipline, and not a “proceeding” or “legislative decision” (¶¶17-18). The Court held that  such administrative actions, even by legislative bodies, are subject to judicial review if they infringe fundamental rights, lack constitutional authority, or are arbitrary (¶¶19-20). The Court ruled that expulsion impacted the  fundamental rights of the petitioner and representative governance, necessitating judicial scrutiny of its legality and proportionality (¶¶21-22).Proportionality of Punishment Imposed by the HouseThe Supreme Court held that Constitutional Courts can examine the proportionality of punishments imposed by legislative bodies. The doctrine of proportionality requires that punitive measures be necessary, balanced, and the least restrictive means to achieve disciplinary objectives (¶¶25-26, ¶62). The Court reasoned that expulsion, being a grave measure, must be reserved for exceptional cases and account for its impact on democratic representation (¶¶57-59). The Court outlined guiding factors for assessing proportionality, including: (i) the degree of obstruction caused by the member; (ii) whether the conduct harmed the House’s dignity; (iii) the member’s prior and subsequent conduct (remorse); (iv) availability of lesser penalties; and (v) balancing societal interests, such as the electorate’s right to representation (¶64). The Court held that while Constitutional Courts must defer to legislative autonomy, they must intervene if the punishment is manifestly disproportionate or shocks constitutional conscience (¶61).Power of the Supreme Court to Determine Quantum of Punishment under Article 142The Supreme Court reasoned  that while judicial restraint ordinarily requires courts to remit matters of punishment to disciplinary authorities, Article 142 empowers it to substitute the punishment in exceptional cases to ensure “complete justice” (¶¶79-81). The Court ruled   that remanding the matter to the Ethics Committee for reconsideration would result in protracted proceedings, depriving the Petitioner of participation in legislative sessions and exacerbating the infringement of his fundamental rights under Article 14 (¶¶82-83). The Court found that the Petitioner had already undergone seven months of expulsion, with his term set to expire in 2026, leaving limited time for representation (¶82).The Supreme  Court therefore modified the punishment by Invoking Article 142, deeming the period of expulsion already served as equivalent to suspension, which it held was proportionate to the misconduct (¶86).The Supreme Court reinstated the Petitioner as a member of the Bihar Legislative Council with immediate effect but barred him from claiming remuneration for the expulsion period. The Court clarified that this modification did not condone the Petitioner’s conduct and warned against future misconduct (¶¶86-87). As a result, the Press Note dated 30.12.2024 issued by Election Commission, declaring the bye-election for the seat earlier held by the Petitioner was quashed, and all actions following it were annulled.Prepared by Osama Noor and Raza ZaidiCentre for Research and Planning |  Supreme Court of India© Supreme Court of IndiaRead MoreView Judgment"
  },
  {
    "serial_number": "5",
    "date_of_judgment": "07-02-2025",
    "cause_title": "VIHAAN KUMAR vs THE STATE OF HARYANACrl.A. No. 621/2025",
    "subject": "Consequence of not informing grounds of arrest",
    "summary": "VIHAAN KUMAR V. THE STATE OF HARYANA2025 INSC 162(7 February 2025)Justices:Justice Abhay S. Oka, Justice Nongmeikapam Kotiswar SinghQuestion(s):(i)Whether the Appellant’s arrest was rendered illegal due to non-compliance with Article 22(1) of the Constitution (failure to communicate grounds of arrest).(ii)Whether the Appellant’s treatment (handcuffing and chaining to a hospital bed) violated his fundamental right to dignity under Article 21.(iii)Whether subsequent legal processes (remand, chargesheet) can validate an arrest vitiated by constitutional violations.Factual Background:Vihaan Kumar (“Appellant”), was arrested on 10 June 2024 for offences under Sections 409, 420, 467, 468, and 471 read with Section 120-B of the Indian Penal Code. The Appellant filed a writ petition under Article 226 of the Constitution  before the Punjab and Haryana High Court challenging his arrest as illegal, which was dismissed on 30 August 2024.  Consequently, he appealed before the Supreme Court. The Appellant claimed that he was arrested at 10:30 AM on 10 June 2024 and produced before a magistrate on 11 June 2024 at 3:30 PM, alleging a violation of Article 22(2) (failure to produce within 24 hours). He further contended that the grounds of arrest were not communicated to him, breaching Article 22(1). The State, however, asserted that the arrest occurred at 6:00 PM on 10 June 2024, complying with the 24-hour rule, and that the grounds were orally communicated.A critical additional grievance arose when the Appellant, after arrest, was hospitalized at PGIMS, Rohtak, where he was handcuffed and chained to a hospital bed. Photographic evidence corroborated this treatment, prompting the Supreme Court to issue notices to the hospital and police authorities. The State later suspended the involved officers and initiated a departmental inquiry.Decision of the Supreme Court:The Supreme Court allowed the appeal, declaring the Appellant’s arrest illegal due to non-compliance with Article 22(1). The Court ordered the Appellant’s immediate release, quashed all subsequent remand orders, and directed the State of Haryana to issue guidelines prohibiting the handcuffing of accused persons in hospitals. The judgment of the Court was authored by Justice Oka. Justice Singh authored a concurring opinion.Reasons for the Decision:Violation of Article 22(1): Failure to Communicate Grounds of ArrestThe Supreme Court held  that Article 22(1) mandates that an arrested person be informed of the grounds of arrest “as soon as may be,” ensuring the ability to challenge detention and seek legal remedies. The Court referred toPankaj Bansal v. Union of India2023 INSC 866 andPrabir Purkayastha v. State (NCT of Delhi)2024 INSC 414 and held  that communication of grounds must be meaningful and effective, preferably in writing, to avoid disputes. While Article 22(1) does not explicitly require written communication, the Court ruled that vague assertions or oral claims by police are insufficient (¶¶11-14).The Appellant’s petition specifically pleaded non-communication of grounds of arrest, which the State failed to counter in its affidavits. Instead, the State claimed the Appellant’s wife was informed, which the Supreme Court dismissed as irrelevant to constitutional compliance (¶¶22-24). The State’s reliance on a case diary entry (recording communication of grounds at 6:10 PM) was rejected by the Court as an “afterthought” due to the absence of contemporaneous documentation of the actual grounds (¶27). The Court reasoned that the burden to prove compliance lies on the State, and mere diary entries without detailing the grounds were deemed inadequate. The Court thus held that non-compliance with Article 22(1) vitiated the arrest, rendering all subsequent custody unlawful (¶22-28).Violation of Article 21: Handcuffing and Chaining to Hospital BedThe Supreme Court condemned the Appellant’s treatment as a gross violation of dignity under Article 21. The Court found the handcuffing and chaining to a hospital bed without justification shocking and unconstitutional. The Court directed the State to issue guidelines to prevent such practices, emphasizing that custodial treatment must respect human dignity (¶29).Effect of Subsequent Legal ProcessesThe State argued that the filing of a chargesheet validated the Appellant’s custody. The Supreme  Court rejected this and held that constitutional violations at the arrest stage cannot be cured by subsequent procedures. The Court reasoned that once an arrest is vitiated under Article 22(1), continued detention based on remand orders or trial proceedings remains unlawful (¶16).Justice Singh in his concurring opinion, reinforced Justice Oka’s conclusions while elaborating on the constitutional and statutory imperatives underpinning the communication of grounds of arrest. He reasoned  that the mandate of Article 22(1) — requiring arrested persons to be informed of the grounds of arrest — is not merely procedural but a fundamental safeguard to protect liberty under Article 21. Justice Singh  ruled  that written communication of grounds is essential to ensure the arrestee can meaningfully challenge detention and seek legal remedies. Justice Singh further noted that statutory provisions such as Section 50 of the Code of Criminal Procedure, 1973 (“CrPC”)  (Section 47 of the Bharatiya Nagarik Suraksha Sanhita, 2023) and Section 19 of the Prevention of Money Laundering Act, 2002 operationalize this constitutional right, making non-compliance a fatal illegality (J. Singh ¶2).Justice Singh expanded on the role of Section 50A of the CrPC, which obligates authorities to inform the arrestee’s relatives or nominated persons about the arrest and its grounds. He reasoned that this requirement  was not a “mere formality” but a critical mechanism to enable the arrestee’s circle to act swiftly — such as arranging legal aid or bail — to actualize the right to liberty. By linking this statutory duty to Article 21, Justice Singh held that the failure to communicate grounds in writing to both the arrestee and their representatives undermines the very purpose of constitutional safeguards, rendering the arrest unlawful (J. Singh ¶3).Prepared by Osama NoorCentre for Research and Planning |  Supreme Court of India© Supreme Court of IndiaRead MoreView Judgment"
  },
  {
    "serial_number": "6",
    "date_of_judgment": "29-01-2025",
    "cause_title": "INDEPENDENT SUGAR CORPORATION LIMITED  vs GIRISH SRIRAM JUNEJAC.A. No. 6071/2023",
    "subject": "Prior approval of the Competition Commission of India (CCI) under Section 31(4) of the Insolvency and Bankruptcy Code (IBC) is mandatory before approval of a Resolution Plan by the Committee of Credit",
    "summary": "INDEPENDENT SUGAR CORPORATION LIMITED  V. GIRISH SRIRAM JUNEJA2025 INSC 124(Invalid Date)Justices:Justice Hrishikesh Roy, Justice Sudhansu Dhulia, and Justice SVN BhattiQuestion(s):(i)Whether the approval of the Competition Commission of India (CCI) for a proposed combination must mandatorily precede the approval of the Resolution Plan by the Committee of Creditors (CoC) under the proviso to Section 31(4) of the Insolvency and Bankruptcy Code, 2016 (IBC)? (ii) Whether the National Company Law Appellate Tribunal (NCLAT) erred in holding that prior CCI approval before CoC approval is only directory and not mandatory? (iii)Whether the Resolution Plan approved by CoC in favour of AGI Greenpac was legally valid despite the alleged lack of statutory approvals at the time of voting?Factual Background:Independent Sugar Corporation Ltd. (INSCO) challenged the approval of a Resolution Plan submitted by AGI Greenpac Ltd. for the acquisition of Hindustan National Glass and Industries Ltd. (HNGIL), a major player in the glass packaging industry. HNGIL, undergoing insolvency proceedings under the IBC, had invited resolution applicants, with both INSCO and AGI Greenpac submitting their respective plans.A key issue arose when AGI Greenpac's Resolution Plan was approved by the CoC on 28.10.2022 with 98% votes, despite lacking prior approval from the CCI. INSCO contended that such approval was mandatory under Section 31(4) of the IBC, especially in cases involving combinations under the Competition Act, 2002. NCLAT ruled that while CCI approval was mandatory, its timing—whether before or after CoC approval—was directory, thus upholding AGI Greenpac's approval. INSCO challenged this ruling before the Supreme Court.Decision of the Supreme Court:A three Judge-Bench of the Supreme Court set aside the NCLAT judgment, holding that prior approval from the CCI before CoC approval ismandatory, not merely directory. The Court ruled that the statutory framework under the IBC and Competition Actrequires compliance with the proviso to Section 31(4) IBC, which mandates obtaining CCI approval before a Resolution Plan involving a combination is put to vote. The order of the Court was rendered by a bench of Justice Hrishikesh Roy, Justice Sudhansu Dhulia, and Justice SVN Bhatti.Reasons for the Decision:Plain Meaning of the Proviso to Section 31(4) IBCThe Court applied theprinciple of plain meaning, holding that the statutory language clearly mandates that where a Resolution Plan contains a provision for a combination, CCI approval must be obtainedpriorto CoC approval (¶35). The legislative intent behind inserting the provision to Section 31(4) of the IBC suggests that prior approval of the CCI was specifically mandated and it should not be seen as a flexible provision to be ignored in certain exigencies. Interpreting it as merely a directory would go against the legislature’s intent. Such a view would weaken the provision and render it ineffective. (¶53).Legislative Intent and Reports Supporting Mandatory ComplianceThe CCI, under Section 31(3) of the Competition Act and Regulation 25(1)(A) of the Combination Regulations, must approve, reject, or modify a combination before the CoC considers it. This ensures that the CoC, while exercising its commercial wisdom, has complete regulatory information ((¶79-81). Therefore, the approval from CCI must be obtained before the same is approved by the CoC. Otherwise, an illogical situation may arise since any modifications so directed by the CCI, would be kept out of the scrutiny of the CoC and the CoC would be forced to exercise its commercial wisdom without complete information  (¶80-81). The Court also examined that when a Resolution Plan containing a provision for a combination that leads to an Appreciable Adverse Effect on Competition (AAEC) is placed before the CoC for approval before securing prior approval from the CCI,the Plan is incapable of being enforced or implemented. Specific consequences in law are provided under the IBC and the Competition Act for the same. As is clear, such a major omission cannot be cured at a later stage. In the present case, the CCI-unapproved Resolution Plan does not pass muster. The same cannot be approved by this Court as it is in violation of Sections 30(2)(e), 30(3), 30(4), and 34(4)(a) of the IBC, thereby contravening provisions of the law for the time being in force (¶86).Harmony between Stipulated TimelinesNCLAT held that the proviso to Section 31(4) of the IBC is directory, reasoning that mandatory prior approval from the CoC would disrupt CIRP timelines. The Supreme Court rejected this, emphasizing that statutory provisions take precedence over subordinate regulations and that the IBC and Competition Act timelines generally do not conflict. It noted that CCI typically approves combination proposals within 21 working days, with no recorded instance of approval exceeding 120 days, making concerns over extended delays largely theoretical. The Court also observed that combination applications can be submitted at multiple stages, including the Expression of Interest or issuance of RFRP, rather than waiting until the Resolution Plan stage, ensuring CIRP completion within 330 days. In rare cases involving significant AAEC concerns, delays may occur, but these are due to regulatory processes rather than actions of the parties involved. The recent Competition (Amendment) Act, 2023, reducing CCI approval timelines, further supports the feasibility of completing insolvency proceedings within statutory limits. Therefore, the Court found no substantial basis for interpreting the provisions disjunctively, as done by the NCLAT (¶87-99).CoC's Role and Procedural Lapses in AGI Greenpac’s Plan ApprovalThe Supreme Court examined the procedural lapses in the approval process of the AGI Greenpac-HNGIL combination under the Competition Act, emphasizing that prior CCI approval is mandatory before a transaction is finalized. The CCI had initially found AGI Greenpac’s Form I submission incomplete and directed the submission of a detailed Form II, eventually granting approval with voluntary modifications, including the divestment of an HNGIL plant (¶119). However, a key procedural lapse occurred when the CCI failed to issue a mandatory Show Cause Notice (SCN) to HNGIL, the target company, as required under Section 29(1) of the Competition Act, limiting its ability to participate in the review process. The law mandates that all parties to a combination, including the acquirer and the target, must be notified of potential competition concerns to ensure transparency and fairness (¶124-125).The Court further noted that the Competition Act requires a structured fact-finding process, including stakeholder consultations, which was not adequately followed in this case. The failure to properly scrutinize and notify all relevant parties before approving the combination raised concerns about whether market competition was sufficiently protected (¶129). Additionally, the Court highlighted that Regulation 25(1A) of the Combination Regulations mandates that any voluntary modification to a combination, such as divestment, must have the approval of both the acquirer and the target company to protect stakeholder interests. This requirement is not a mere procedural formality but a substantive safeguard, ensuring that modifications do not undermine the operational and structural integrity of the target company. In this case, the proposed divestment of the target’s plant was a crucial part of its revival under the IBC, making the target company’s active participation essential for compliance with both insolvency and competition laws. Given these deficiencies, the Court emphasized that the lack of participation by the Target in the voluntary modification process, especially where the modification entails the divestment of their assets, vitiates the approval granted by the CCI and warrants remedial intervention by this Court (¶136-139).Justice SVN Bhatti’s Dissenting Opinion:Literal vs Purposive Interpretation (¶¶ 37-42)Justice Bhatti analyzed the principle of literal interpretation, stating that statutory words must be given their ordinary meaning unless such an approach results in absurdity or contradicts legislative intent (¶38). He citedMadhav Rao Scindia vs Union of India (AIR (1971) SC 530), emphasizing that words can have multiple shades of meaning, requiring interpretation in context (¶39). Referring toCorp of the City of Victoria vs Bishop of Vancouver Island (AIR (1971) SC 530), he explained that purposive interpretation is necessary to avoid inconsistency and ensure statutes remain workable (¶41). He held that rigid literalism should not obstruct the IBC’s objective of efficient insolvency resolution (¶42)?.Interpretation of Section 31(4) and its Proviso (¶¶ 52-55)Justice Bhatti examined the amendments introduced by Act 26 of 2018, particularly the insertion of the proviso to Section 31(4). He noted that the IBC was designed to enhance India’s business environment, and the amendment aimed to clarify that Competition Commission of India (CCI) approval must be obtained before CoC approval (¶52). However, he reasoned that external aids such as explanatory notes and legislative history should be considered only after analyzing the provision's language and intent (¶54). He referred toEssar Steel India Ltd. (2020) 8 SCC 531)to highlight the importance of CoC’s commercial wisdom and the Adjudicating Authority’s role in ensuring statutory compliance (¶55)?.Timing of CCI Approval and Effect on Resolution Applicants (¶¶ 65-66)Justice Bhatti emphasized that while CCI approval is essential before final adjudication under Section 31, its absence at the CoC approval stage does not invalidate the resolution plan. He pointed out that mandating CCI approval before CoC voting could exclude viable applicants and hinder competition, thereby reducing asset value maximization (¶65). He held that the phrase “prior to” in the proviso to Section 31(4) is a temporal expression that should be interpreted flexibly, allowing CCI approval to be obtained before Adjudicating Authority approval rather than at the CoC stage (¶66)?.Judicial Precedents and the Role of Adjudicating Authority (¶¶ 78-81)Justice Bhatti referred to NCLAT rulings inArcelorMittal (2019 SCC OnLine NCLAT 920),Vishal Vijay Kalantari (2021 SCC OnLine SC 3243), andMakalu Trading Limited (2020 SCC OnLine NCLAT 643), where it was held that Section 31(4) is directory. He asserted that commercial wisdom of the CoC should not be constrained by regulatory conditions that can be addressed later in the process (¶78). He concluded that the consequences of non-compliance with combination approval requirements should be assessed at the Adjudicating Authority stage, ensuring adherence to both the IBC and Competition Act without disrupting the resolution process (¶79-81)?The Supreme Court ruled that prior approval of the CCI ismandatorybefore the CoC considers a Resolution Plan involving a combination. It held that the approval of AGI Greenpac’s Resolution Plan was legallyinvalid, as it lacked CCI clearance at the time of CoC approval. The Courtremanded the matterto the NCLT to reconsider the Resolution Plans in compliance with statutory provisions.Prepared by Iram JanCommunications Division|  Supreme Court of India© Supreme Court of IndiaRead MoreView Judgment"
  },
  {
    "serial_number": "7",
    "date_of_judgment": "02-01-2025",
    "cause_title": "URMILA DIXIT vs SUNIL SHARAN DIXITC.A. No. 10927/2024",
    "subject": "Right of a senior citizen to claim back their transferred property under the Section 23 of the Maintenance and Welfare of the Parents and Senior Citizens Act, 2007",
    "summary": "URMILA DIXIT V. SUNIL SHARAN DIXIT2025 INSC 20(2 January 2025)Justices:Justice Sanjay Karol and Justice Chudalayil T. RavikumarQuestion(s):(i)Whether a property transferred by senior citizens by gift or any other medium  can be claimed back under the Section  23 of the Maintenance and Welfare of the Parents and Senior Citizens Act, 2007 (“the Act”).(ii)Whether the authorities under the Section 23 of the Act can order eviction from the property and grant the possession to the concerned senior citizens.Factual Background:Section 23 of the Act states that if the person who received property fails to take care of the giver, the transfer can be canceled, as if it were obtained by fraud or force. A Gift Deed was executed by the mother in favour of her son on 7 September 2019 of  the  property which she had  purchased on 23 January 1968. The Deed stated that the son would maintain the mother  and the same was registered on 9 September 2019. Allegedly, the same day avachan patra/promissory note was executed by the son stating  that he will take care of the mother and father till the end of their life and if he does not do so, the mother will be at liberty to take back the Gift Deed.On 24 December 2020 the mother filed an application under the Section 23 of the Act before the Sub Divisional Magistrate alleging attacks by the son regarding  the further transfer of property, and sought cancellation of the Deed as there was no love and affection left between the parties. This application was allowed by the Sub Divisional Magistrate  and the deed was declarednull and void(not valid in law). However, the son preferred an appeal which was dismissed on 25 April 2022 by the Collector. Subsequently, the son  filed a writ petition before the High Court of Madhya Pradesh. A Single-Judge Bench upheld the order of the Collector and dismissed the writ petition. The son then filed a writ appeal, and a Division-Bench of the High Court reversed the order of the Single-Judge  and found  the deed valid. Consequently, the mother filed an appeal in the Supreme Court.Decision of the Supreme Court:A Two-Judge Bench of the Supreme Court upheld the decision of the Single-Judge Bench of the High Court and the authorities  below and cancelled the Gift Deed because the conditions in the gift were not complied with. The Court also ruled  that the authorities while exercising jurisdiction under the Section 23 of the Act can order possession to be transferred. The judgment of the Court was authored by Justice Karol.Reasons for the Decision:Liberal interpretation of the ActThe Supreme Court held that the objective of the Act is to  empower senior citizens to secure their rights promptly when they transfer a property subject to the condition of being maintained by the transferee (¶25). The Court referred toK. H. Nazar v. Mathew K. Jacob,(2019 INSC 1100),in which it was held  that the provisions of a beneficial legislation have to be interpreted with a purpose-oriented approach and the problem that a statute was designed to remedy should first be identified and then a meaning  that resolves the problem should be adopted (¶9).The Supreme Court ruled that the Statement of Object and Reasons and Preamble of the Act embodies  the intent of the Act which is to ensure effective maintenance and welfare of parents and senior citizens, guaranteed and recognised under the Constitution (¶12). Therefore, the Act is a beneficial legislation  aimed at securing the rights of senior citizens in view of the challenges faced by them and must be given a liberal meaning to it (¶14).  The Court observed  that it is the social obligation of the children to maintain their parents when they need them and it is bound by the Constitution to advance the cause of social justice pertaining to maintenance of parents or wife (¶¶15-16).Application of Section 23 of the ActThe Supreme Court, after scrutinizing the Gift Deed and Promissory Note, held that the two ingredients necessary for the application of the Section 23, as propounded inSudesh Chhikara v. Ramti Devi, (2022 INSC 1257), i.e., the transfer should have a condition attached to it regarding maintenance and basic needs, and the transferee has failed to provide such amenities and physical needs to the transferor, were fulfilled in the present case. The Supreme Court thus held that both documents had a condition of maintenance of the mother by the son, which was not honored (¶¶ 20-23).The Supreme Court held that the purpose of the Act is to provide speedy, simple, and inexpensive remedies for the elderly, and therefore the authorities under the Section 23 of the Act have the power to order eviction and grant possession of the property to the concerned senior citizens (¶24).Prepared By: Rudrakshi Sharma (Intern)Centre for Research and Planning, Supreme Court of IndiaRead MoreView Judgment"
  }
]